app/controllers/spots_controller.rb

  def create
  	@spot = Spot.new(spot_params)
  	if @spot.save
---
INSERT INTO "spots" ("address", "created_at", "name", "phone", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
  	if @spot.update(spot_params)
---
UPDATE "spots" SET "name" = $1, "updated_at" = $2 WHERE "spots"."id" = 210  [["name", "Rafa's"], ["updated_at", "2014-10-11 22:32:16.698526"]]

  def destroy
  	@spot.destroy
---
DELETE FROM "spots" WHERE "spots"."id" = $1  [["id", 212]]

  def load_spot
  	@spot = Spot.find(params[:id])
---
SELECT  "spots".* FROM "spots"  WHERE "spots"."id" = $1 LIMIT 1  [["id", 212]]