app/controllers/users_controller.rb

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
  	  if @user.update(user_params)
---
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = 272  [["email", "molly@gmail.com"], ["updated_at", "2014-10-11 22:32:16.872842"]]

  def load_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 275]]